src/Documents/Посещение/Посещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Посещение</name>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудник</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодЦены</name>
    <type>
      <types>CatalogRef.Цена</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПосещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПерсон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/Посещение/Forms/ФормаДокумента/Module.bsl
//Функция, чтобы избежать дублирования
&НаКлиенте
Функция ЗаполнитьСуммуПосещения()
	Объект.СуммаПосещения = (Объект.КоличествоМинут * ПолучитьЦенуПосещения(Объект.КодЦены)) * Объект.КоличествоПерсон;	
КонецФункции

//Расчет суммы посещения в зависимости от дня посещения (цены), количества минут и количества персон
&НаКлиенте
Процедура КоличествоМинутПриИзменении(Элемент)
	Если  ЗначениеЗаполнено(Объект.КодЦены) И ЗначениеЗаполнено(Объект.КоличествоПерсон) Тогда
		ЗаполнитьСуммуПосещения();	
	КонецЕсли	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуПосещения(СпрЦена)
	Справочники.Цена.НайтиПоКоду(СпрЦена);
	Возврат СпрЦена.ЦенаЗаМинуту;
КонецФункции

&НаКлиенте
Процедура КодЦеныПриИзменении(Элемент)
	Если  ЗначениеЗаполнено(Объект.КоличествоМинут) И ЗначениеЗаполнено(Объект.КоличествоПерсон) Тогда
		ЗаполнитьСуммуПосещения();	
	КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПерсонПриИзменении(Элемент)
	Если  ЗначениеЗаполнено(Объект.КоличествоМинут) И ЗначениеЗаполнено(Объект.КодЦены) Тогда
		ЗаполнитьСуммуПосещения();	
	КонецЕсли
КонецПроцедуры
